app/controllers/dashboards_controller.rb

  def index
    @templates = Template.all
---
SELECT "templates".* FROM "templates"