app/controllers/dashboards_controller.rb

SELECT "templates".* FROM "templates"  WHERE "templates"."admin_id" = 1
---
  def index
    @templates = Template.where(admin_id: current_admin.id)