app/controllers/educations_controller.rb

  def index
    @edus = Education.all
---
SELECT "educations".* FROM "educations"

  def create
    @edu = Education.new(new_education_param)
    Rails.logger.info ">>>>>>>>>>>>>>>>> #{@edu.inspect}"

    if @edu.save
---
INSERT INTO "educations" ("school_address", "school_name", "user_id") VALUES (?, ?, ?)  [["school_address", "Meruya"], ["school_name", "IPEKA International Christian High School"], ["user_id", 1]]

  def edit
    @edu = Education.find(find_education_param)
---
SELECT  "educations".* FROM "educations"  WHERE "educations"."id" = ? LIMIT 1  [["id", 13]]

  def update
    @edu = Education.find(find_education_param)
    if @edu.update_attributes(update_education_param)
---
SELECT  "educations".* FROM "educations"  WHERE "educations"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "educations" SET "school_address" = ? WHERE "educations"."id" = 13  [["school_address", "Kensington NSW 2032"]]

  def destroy
    @edu = Education.find(find_education_param)
    Rails.logger.info ">>>>>>>>>>>>>>> #{destroy_education_param.inspect}"

    @edu.delete
---
SELECT  "educations".* FROM "educations"  WHERE "educations"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "educations" WHERE "educations"."id" = 1