app/controllers/experiences_controller.rb

SELECT "experiences".* FROM "experiences"
---
  def index
    @exps = Experience.all

INSERT INTO "experiences" ("company_name", "end_date", "job_title", "start_date") VALUES (?, ?, ?, ?)  [["company_name", "jio"], ["end_date", "1993-11-11"], ["job_title", "fjsoi"], ["start_date", "1992-11-11"]]
---
  def create
    @exp = Experience.new(new_experience_params)

    if @exp.save

SELECT  "experiences".* FROM "experiences"  WHERE "experiences"."id" = ? LIMIT 1  [["id", 2]]
---
  def edit
    @exp = Experience.find(find_experience_params)

SELECT  "experiences".* FROM "experiences"  WHERE "experiences"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "experiences" SET "end_date" = ? WHERE "experiences"."id" = 2  [["end_date", "2013-12-04"]]
---
  def update
    @exp = Experience.find(find_experience_params)

    if @exp.update_attributes(new_experience_params)

SELECT  "experiences".* FROM "experiences"  WHERE "experiences"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "experiences" WHERE "experiences"."id" = 3
---
  def destroy
    @exp = Experience.find(find_experience_params)

    @exp.delete