app/controllers/homepages_controller.rb

  def index
    @educations = Education.where(user_id: current_user.id)
    @experiences = Experience.where(user_id: current_user.id)
---
SELECT "educations".* FROM "educations"  WHERE "educations"."user_id" = 1
SELECT "experiences".* FROM "experiences"  WHERE "experiences"."user_id" = 1