app/controllers/templates_controller.rb

INSERT INTO "templates" ("admin_id", "css_template_content_type", "css_template_file_name", "css_template_file_size", "css_template_updated_at", "html_template_content_type", "html_template_file_name", "html_template_file_size", "html_template_updated_at", "template_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @template = Template.new(new_template_params)
    @template.admin_id = current_admin.id

    if admin_signed_in? && @template.save

SELECT  "templates".* FROM "templates"  WHERE "templates"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @template = Template.find(find_template_params)

SELECT  "templates".* FROM "templates"  WHERE "templates"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "templates" SET "css_template_file_name" = ?, "css_template_file_size" = ?, "css_template_updated_at" = ? WHERE "templates"."id" = 1  [["css_template_file_name", "anything.css"], ["css_template_file_size", 8], ["css_template_updated_at", "2014-11-16 04:13:44.101637"]]
---
  def update
    @template = Template.find(find_template_params)

    if @template.update_attributes(new_template_params)

SELECT  "templates".* FROM "templates"  WHERE "templates"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "templates" WHERE "templates"."id" = 1
---
  def destroy
    @template = Template.find(find_template_params)

    @template.html_file = nil
    @template.css_file = nil
    @template.delete